eisup_2019_docmng_integration/src/ChartsOfCharacteristicTypes/абс_СвойстваОС/абс_СвойстваОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>абс_СвойстваОС</name>
  <type>
    <types>CatalogRef.ПодразделенияОрганизаций</types>
    <types>CatalogRef.абс_ТипыСтроений</types>
    <types>CatalogRef.МестаЭксплуатацииПоСооружению</types>
    <types>Boolean</types>
    <types>CatalogRef.ЦелиИспользования</types>
    <types>CatalogRef.абс_КатегорииЗемель</types>
    <types>CatalogRef.Подразделения</types>
    <types>EnumRef.абс_ТипКровли</types>
    <types>CatalogRef.Контрагенты</types>
    <types>String</types>
    <types>CatalogRef.Должности</types>
    <types>Date</types>
    <types>Number</types>
    <types>EnumRef.абс_АрендуемоеСобственное</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>200</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БухгалтерскаяИнформацияОбОбъектеНедвижимостиОфисныеЗдания</name>
      <description>Бухгалтерская информация</description>
      <code>000000111</code>
      </content>
        </content>
      </content>
      </content>
    </items>
    <items>
      <name>КоммерческаяИБухгалтерскаяИнформацияОСлужебномАвтомобили</name>
      <description>Коммерческая и бухгалтерская информация о служебном автомобили</description>
      <code>000000022</code>
      </content>
      </content>
    </items>
    <items>
      <name>КоммерческаяИнформацияОбОъектеНедвижимости</name>
      <description>Коммерческая информация</description>
      <code>000000110</code>
        </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>ОбщаяИнформацияОбОбъектеНедвижимости</name>
      <description>Общая информация</description>
      <code>000000045</code>
      </content>
    </items>
    <items>
      <name>ОбщаяИнформацияОСлужебномАвтомобили</name>
      <description>Общая информация о служебном автомобили</description>
      <code>000000001</code>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>ПравоваяИнформацияОбОбъектеНедвижимости</name>
      <description>Правовая информация</description>
      <code>000000109</code>
    </items>
    <items>
      <name>ТехническаяИнформацияОбОбъектеНедвижимости</name>
      <description>Техническая информация</description>
      <code>000000064</code>
      </content>
      </content>
      </content>
        </content>
      </content>
      </content>
      </content>
        </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>РедактируетсяВТаблице</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблЧасть</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗемельныйУчасток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗданияЭТЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗданияОфисы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗданияГаражи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

eisup_2019_docmng_integration/src/ChartsOfCharacteristicTypes/абс_СвойстваОС/Forms/ФормаГруппы/Module.bsl
&НаКлиенте
Процедура ЗаполнитьДляПодчиненных(Команда)

	Если НЕ Объект.ЭтоГруппа Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Ответ = Вопрос("Записать?", РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли;
		Записать();
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("ТранспортноеСредство, ЗемельныйУчасток, ЗданияЭТЦ, ЗданияОфисы, ЗданияГаражи");
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Объект);
	
	ЗаполнитьДляПодчиненныхСервер(Объект.Ссылка, СтруктураРеквизитов);
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДляПодчиненныхСервер(Ссылка, СтруктураРеквизитов)
	
	ПланыВидовХарактеристик.абс_СвойстваОС.ЗаполнитьГруппуОСДляПодчиненных(Ссылка, СтруктураРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры
